var stations = [
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Бульвар Рокоссовского",
    "Дата открытия": "01.08.1990",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8148°с.ш. 37.7342°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Черкизовская",
    "Дата открытия": "01.08.1990",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8038°с.ш. 37.7448°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Преображенская площадь",
    "Дата открытия": "31.12.1965",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7963°с.ш. 37.7151°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Сокольники",
    "Дата открытия": "15.05.1935",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7888°с.ш. 37.6802°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Красносельская",
    "Дата открытия": "15.05.1935",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7801°с.ш. 37.6673°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Комсомольская",
    "Дата открытия": "15.05.1935",
    "Пересадки": "Переход на станцию Комсомольская Кольцевой линии",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7753°с.ш. 37.6562°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Красные ворота",
    "Дата открытия": "15.05.1935",
    "Пересадки": "",
    "Глубина": "−31 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7690°с.ш. 37.6487°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Чистые пруды",
    "Дата открытия": "15.05.1935",
    "Пересадки": "Переход на станцию Тургеневская Калужско-Рижской линииПереход на станцию Сретенский бульвар Люблинско-Дмитровской линии",
    "Глубина": "−35 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7657°с.ш. 37.6388°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Лубянка",
    "Дата открытия": "15.05.1935",
    "Пересадки": "Переход на станцию Кузнецкий мост Таганско-Краснопресненской линии",
    "Глубина": "−32,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7597°с.ш. 37.6272°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Охотный ряд",
    "Дата открытия": "15.05.1935",
    "Пересадки": "Переход на станцию Театральная Замоскворецкой линии",
    "Глубина": "−15 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7577°с.ш. 37.6166°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Библиотека имени Ленина",
    "Дата открытия": "15.05.1935",
    "Пересадки": "Переход на станцию Арбатская Арбатско-Покровской линииПереход на станцию Александровский сад Филёвской линииПереход на станцию Боровицкая Серпуховско-Тимирязевской линии",
    "Глубина": "−12 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.7512°с.ш. 37.6100°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Кропоткинская",
    "Дата открытия": "15.05.1935",
    "Пересадки": "",
    "Глубина": "−13 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7453°с.ш. 37.6037°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Парк культуры",
    "Дата открытия": "15.05.1935",
    "Пересадки": "Переход на станцию Парк культуры Кольцевой линии",
    "Глубина": "−10,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7356°с.ш. 37.5943°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Фрунзенская",
    "Дата открытия": "01.05.1957",
    "Пересадки": "",
    "Глубина": "−42 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7267°с.ш. 37.5786°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Спортивная",
    "Дата открытия": "01.05.1957",
    "Пересадки": "",
    "Глубина": "−42 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7233°с.ш. 37.5639°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Воробьёвы горы",
    "Дата открытия": "12.01.1959",
    "Пересадки": "",
    "Глубина": "+10 м",
    "Тип конструкции": "эстакадная крытая",
    "Координаты": "55.7103°с.ш. 37.5592°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Университет",
    "Дата открытия": "12.01.1959",
    "Пересадки": "",
    "Глубина": "−26,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.6926°с.ш. 37.5333°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Проспект Вернадского",
    "Дата открытия": "30.12.1963",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6771°с.ш. 37.5060°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Юго-Западная",
    "Дата открытия": "30.12.1963",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6637°с.ш. 37.4833°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Тропарёво",
    "Дата открытия": "08.12.2014",
    "Пересадки": "",
    "Глубина": "−12 м[2]",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6459°с.ш. 37.4725°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Румянцево",
    "Дата открытия": "18.01.2016",
    "Пересадки": "",
    "Глубина": "−12 м[3]",
    "Тип конструкции": "колонная",
    "Координаты": "55.6330°с.ш. 37.4419°в.д."
  },
  {
    "Линия": "Сокольническая линия",
    "Название станции": "Саларьево",
    "Дата открытия": "15.02.2016",
    "Пересадки": "",
    "Глубина": "−12 м[4]",
    "Тип конструкции": "колонная",
    "Координаты": "55.6219°с.ш. 37.4242°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Речной вокзал",
    "Дата открытия": "31.12.1964",
    "Пересадки": "",
    "Глубина": "−6 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8549°с.ш. 37.4761°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Водный стадион",
    "Дата открытия": "31.12.1964",
    "Пересадки": "",
    "Глубина": "−6 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8398°с.ш. 37.4867°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Войковская",
    "Дата открытия": "31.12.1964",
    "Пересадки": "",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8190°с.ш. 37.4980°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Сокол",
    "Дата открытия": "11.09.1938",
    "Пересадки": "",
    "Глубина": "−9,6 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8051°с.ш. 37.5153°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Аэропорт",
    "Дата открытия": "11.09.1938",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8003°с.ш. 37.5329°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Динамо",
    "Дата открытия": "11.09.1938",
    "Пересадки": "",
    "Глубина": "−39,6 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7897°с.ш. 37.5580°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Белорусская",
    "Дата открытия": "11.09.1938",
    "Пересадки": "Переход на станцию Белорусская Кольцевой линии",
    "Глубина": "−33,1 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7767°с.ш. 37.5835°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Маяковская",
    "Дата открытия": "11.09.1938",
    "Пересадки": "",
    "Глубина": "−33,1 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7701°с.ш. 37.5958°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Тверская",
    "Дата открытия": "20.07.1979",
    "Пересадки": "Переход на станцию Пушкинская Таганско-Краснопресненской линииПереход на станцию Чеховская Серпуховско-Тимирязевской линии",
    "Глубина": "−42 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7647°с.ш. 37.6065°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Театральная",
    "Дата открытия": "11.09.1938",
    "Пересадки": "Переход на станцию Охотный ряд Сокольнической линииПереход на станцию Площадь Революции Арбатско-Покровской линии",
    "Глубина": "−33,9 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7578°с.ш. 37.6190°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Новокузнецкая",
    "Дата открытия": "20.11.1943",
    "Пересадки": "Переход на станцию Третьяковская Калужско-Рижской линииПереход на станцию Третьяковская Калининской линии",
    "Глубина": "−37,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7415°с.ш. 37.6295°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Павелецкая",
    "Дата открытия": "20.11.1943",
    "Пересадки": "Переход на станцию Павелецкая Кольцевой линии",
    "Глубина": "−33,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7305°с.ш. 37.6377°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Автозаводская",
    "Дата открытия": "01.01.1943",
    "Пересадки": "",
    "Глубина": "−11 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7074°с.ш. 37.6576°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Технопарк",
    "Дата открытия": "28.12.2015",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная крытая колонная трёхпролётная",
    "Координаты": "55.6950°с.ш. 37.6641°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Коломенская",
    "Дата открытия": "11.08.1969",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6785°с.ш. 37.6638°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Каширская",
    "Дата открытия": "11.08.1969",
    "Пересадки": "Кросс-платформенная пересадка на станцию Каширская Каховской линии",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6551°с.ш. 37.6487°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Кантемировская",
    "Дата открытия": "30.12.1984",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6358°с.ш. 37.6564°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Царицыно",
    "Дата открытия": "30.12.1984",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6214°с.ш. 37.6694°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Орехово",
    "Дата открытия": "30.12.1984",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6132°с.ш. 37.6949°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Домодедовская",
    "Дата открытия": "07.09.1985",
    "Пересадки": "",
    "Глубина": "−9,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6108°с.ш. 37.7186°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Красногвардейская",
    "Дата открытия": "07.09.1985",
    "Пересадки": "Переход на станцию Зябликово Люблинско-Дмитровской линии",
    "Глубина": "−9 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6137°с.ш. 37.7444°в.д."
  },
  {
    "Линия": "Замоскворецкая линия",
    "Название станции": "Алма-Атинская",
    "Дата открытия": "24.12.2012",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6326°с.ш. 37.7660°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Пятницкое шоссе",
    "Дата открытия": "28.12.2012",
    "Пересадки": "",
    "Глубина": "−11 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8563°с.ш. 37.3544°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Митино",
    "Дата открытия": "26.12.2009",
    "Пересадки": "",
    "Глубина": "−14 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8457°с.ш. 37.3622°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Волоколамская",
    "Дата открытия": "26.12.2009",
    "Пересадки": "",
    "Глубина": "−14 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8354°с.ш. 37.3822°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Мякинино",
    "Дата открытия": "26.12.2009",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, крытая,",
    "Координаты": "55.8252°с.ш. 37.3852°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Строгино",
    "Дата открытия": "07.01.2008",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8038°с.ш. 37.4031°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Крылатское",
    "Дата открытия": "31.12.1989",
    "Пересадки": "",
    "Глубина": "−9,5 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.7567°с.ш. 37.4081°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Молодёжная",
    "Дата открытия": "05.07.1965",
    "Пересадки": "",
    "Глубина": "−6,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7408°с.ш. 37.4168°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Кунцевская",
    "Дата открытия": "07.01.2008",
    "Пересадки": "Кросс-платформенная пересадка на станцию Кунцевская Филёвской линии",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7307°с.ш. 37.4459°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Славянский бульвар",
    "Дата открытия": "07.09.2008",
    "Пересадки": "",
    "Глубина": "−8,5 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.7296°с.ш. 37.4706°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Парк Победы",
    "Дата открытия": "06.05.2003",
    "Пересадки": "Кросс-платформенная пересадка на станцию Парк Победы Калининской линии",
    "Глубина": "−73,6 м[5]",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7362°с.ш. 37.5182°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Киевская",
    "Дата открытия": "05.04.1953",
    "Пересадки": "Переход на станцию Киевская Филёвской линииПереход на станцию Киевская Кольцевой линии",
    "Глубина": "−38 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7442°с.ш. 37.5645°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Смоленская",
    "Дата открытия": "05.04.1953",
    "Пересадки": "",
    "Глубина": "−50 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7474°с.ш. 37.5823°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Арбатская",
    "Дата открытия": "05.04.1953",
    "Пересадки": "Переход на станцию Библиотека имени Ленина Сокольнической линииПереход на станцию Александровский сад Филёвской линииПереход на станцию Боровицкая Серпуховско-Тимирязевской линии",
    "Глубина": "−41 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7522°с.ш. 37.6061°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Площадь Революции",
    "Дата открытия": "13.03.1938",
    "Пересадки": "Переход на станцию Театральная Замоскворецкой линии",
    "Глубина": "−33,6 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7566°с.ш. 37.6216°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Курская",
    "Дата открытия": "13.03.1938",
    "Пересадки": "Переход на станцию Курская Кольцевой линииПереход на станцию Чкаловская Люблинско-Дмитровской линии",
    "Глубина": "−30,7 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7576°с.ш. 37.6577°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Бауманская",
    "Дата открытия": "18.01.1944",
    "Пересадки": "",
    "Глубина": "−32,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7730°с.ш. 37.6806°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Электрозаводская",
    "Дата открытия": "15.05.1944",
    "Пересадки": "",
    "Глубина": "−31,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7817°с.ш. 37.7037°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Семёновская",
    "Дата открытия": "18.01.1944",
    "Пересадки": "",
    "Глубина": "−40 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7833°с.ш. 37.7208°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Партизанская",
    "Дата открытия": "18.01.1944",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7886°с.ш. 37.7506°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Измайловская",
    "Дата открытия": "21.10.1961",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7878°с.ш. 37.7814°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Первомайская",
    "Дата открытия": "21.10.1961",
    "Пересадки": "",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7948°с.ш. 37.7993°в.д."
  },
  {
    "Линия": "Арбатско-Покровская линия",
    "Название станции": "Щёлковская",
    "Дата открытия": "22.07.1963",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8094°с.ш. 37.7986°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Кунцевская",
    "Дата открытия": "31.08.1965",
    "Пересадки": "Кросс-платформенная пересадка на станцию Кунцевская Арбатско-Покровской линии",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7307°с.ш. 37.4459°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Пионерская",
    "Дата открытия": "13.10.1961",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7360°с.ш. 37.4671°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Филёвский парк",
    "Дата открытия": "13.10.1961",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7396°с.ш. 37.4833°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Багратионовская",
    "Дата открытия": "13.10.1961",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7438°с.ш. 37.4977°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Фили",
    "Дата открытия": "07.11.1959",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7460°с.ш. 37.5150°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Кутузовская",
    "Дата открытия": "07.11.1958",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7399°с.ш. 37.5344°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Студенческая",
    "Дата открытия": "07.11.1958",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7388°с.ш. 37.5483°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Международная",
    "Дата открытия": "30.08.2006",
    "Пересадки": "",
    "Глубина": "−25 м",
    "Тип конструкции": "колонно-стеновая",
    "Координаты": "55.7483°с.ш. 37.5339°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Выставочная",
    "Дата открытия": "10.09.2005",
    "Пересадки": "Переход на станцию Деловой центр Калининской линии",
    "Глубина": "−25 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7502°с.ш. 37.5408°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Киевская",
    "Дата открытия": "20.03.1937",
    "Пересадки": "Переход на станцию Киевская Арбатско-Покровской линииПереход на станцию Киевская Кольцевой линии",
    "Глубина": "−8,7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7436°с.ш. 37.5655°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Смоленская",
    "Дата открытия": "15.05.1935",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7488°с.ш. 37.5825°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Арбатская",
    "Дата открытия": "15.05.1935",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7518°с.ш. 37.6007°в.д."
  },
  {
    "Линия": "Филёвская линия",
    "Название станции": "Александровский сад",
    "Дата открытия": "15.05.1935",
    "Пересадки": "Переход на станцию Библиотека имени Ленина Сокольнической линииПереход на станцию Арбатская Арбатско-Покровской линии",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7525°с.ш. 37.6085°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Парк культуры",
    "Дата открытия": "01.01.1950",
    "Пересадки": "Переход на станцию Парк культуры Сокольнической линии",
    "Глубина": "−40 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7357°с.ш. 37.5915°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Октябрьская",
    "Дата открытия": "01.01.1950",
    "Пересадки": "Переход на станцию Октябрьская Калужско-Рижской линии",
    "Глубина": "−40 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7297°с.ш. 37.6091°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Добрынинская",
    "Дата открытия": "01.01.1950",
    "Пересадки": "Переход на станцию Серпуховская Серпуховско-Тимирязевской линии",
    "Глубина": "−35,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7291°с.ш. 37.6243°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Павелецкая",
    "Дата открытия": "01.01.1950",
    "Пересадки": "Переход на станцию Павелецкая Замоскворецкой линии",
    "Глубина": "−40 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7318°с.ш. 37.6379°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Таганская",
    "Дата открытия": "01.01.1950",
    "Пересадки": "Переход на станцию Таганская Таганско-Краснопресненской линииПереход на станцию Марксистская Калининской линии",
    "Глубина": "−53 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7418°с.ш. 37.6517°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Курская",
    "Дата открытия": "01.01.1950",
    "Пересадки": "Переход на станцию Курская Арбатско-Покровской линииПереход на станцию Чкаловская Люблинско-Дмитровской линии",
    "Глубина": "−40 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7570°с.ш. 37.6595°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Комсомольская",
    "Дата открытия": "30.01.1952",
    "Пересадки": "Переход на станцию Комсомольская Сокольнической линии",
    "Глубина": "−37 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7748°с.ш. 37.6549°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Проспект Мира",
    "Дата открытия": "30.01.1952",
    "Пересадки": "Переход на станцию Проспект Мира Калужско-Рижской линии",
    "Глубина": "−40 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7798°с.ш. 37.6318°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Новослободская",
    "Дата открытия": "30.01.1952",
    "Пересадки": "Переход на станцию Менделеевская Серпуховско-Тимирязевской линии",
    "Глубина": "−40 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7799°с.ш. 37.6028°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Белорусская",
    "Дата открытия": "30.01.1952",
    "Пересадки": "Переход на станцию Белорусская Замоскворецкой линии",
    "Глубина": "−42,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7764°с.ш. 37.5844°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Краснопресненская",
    "Дата открытия": "14.03.1954",
    "Пересадки": "Переход на станцию Баррикадная Таганско-Краснопресненской линии",
    "Глубина": "−35,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7613°с.ш. 37.5774°в.д."
  },
  {
    "Линия": "Кольцевая линия",
    "Название станции": "Киевская",
    "Дата открытия": "14.03.1954",
    "Пересадки": "Переход на станцию Киевская Арбатско-Покровской линииПереход на станцию Киевская Филёвской линии",
    "Глубина": "−48 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7446°с.ш. 37.5644°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Медведково",
    "Дата открытия": "30.09.1978",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8872°с.ш. 37.6613°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Бабушкинская",
    "Дата открытия": "30.09.1978",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8694°с.ш. 37.6644°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Свиблово",
    "Дата открытия": "30.09.1978",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8552°с.ш. 37.6527°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Ботанический сад",
    "Дата открытия": "30.09.1978",
    "Пересадки": "",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8449°с.ш. 37.6383°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "ВДНХ",
    "Дата открытия": "01.05.1958",
    "Пересадки": "",
    "Глубина": "−53,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.8211°с.ш. 37.6411°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Алексеевская",
    "Дата открытия": "01.05.1958",
    "Пересадки": "",
    "Глубина": "−51 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.8088°с.ш. 37.6390°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Рижская",
    "Дата открытия": "01.05.1958",
    "Пересадки": "",
    "Глубина": "−46 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7936°с.ш. 37.6362°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Проспект Мира",
    "Дата открытия": "01.05.1958",
    "Пересадки": "Переход на станцию Проспект Мира Кольцевой линии",
    "Глубина": "−50 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7812°с.ш. 37.6318°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Сухаревская",
    "Дата открытия": "05.01.1972",
    "Пересадки": "",
    "Глубина": "−43 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7733°с.ш. 37.6319°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Тургеневская",
    "Дата открытия": "05.01.1972",
    "Пересадки": "Переход на станцию Чистые пруды Сокольнической линииПереход на станцию Сретенский бульвар Люблинско-Дмитровской линии",
    "Глубина": "−49 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7661°с.ш. 37.6374°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Китай-город",
    "Дата открытия": "03.01.1971",
    "Пересадки": "Кросс-платформенная пересадка на станцию Китай-город Таганско-Краснопресненской линии",
    "Глубина": "−29 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7553°с.ш. 37.6333°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Третьяковская",
    "Дата открытия": "03.01.1971",
    "Пересадки": "Переход на станцию Новокузнецкая Замоскворецкой линииКросс-платформенная пересадка на станцию Третьяковская Калининской линии",
    "Глубина": "−46 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7412°с.ш. 37.6274°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Октябрьская",
    "Дата открытия": "13.10.1962",
    "Пересадки": "Переход на станцию Октябрьская Кольцевой линии",
    "Глубина": "−50 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7306°с.ш. 37.6112°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Шаболовская",
    "Дата открытия": "06.11.1980",
    "Пересадки": "",
    "Глубина": "−46,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7198°с.ш. 37.6083°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Ленинский проспект",
    "Дата открытия": "13.10.1962",
    "Пересадки": "",
    "Глубина": "−16 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7077°с.ш. 37.5861°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Академическая",
    "Дата открытия": "13.10.1962",
    "Пересадки": "",
    "Глубина": "−8,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6877°с.ш. 37.5733°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Профсоюзная",
    "Дата открытия": "13.10.1962",
    "Пересадки": "",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6780°с.ш. 37.5627°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Новые Черёмушки",
    "Дата открытия": "13.10.1962",
    "Пересадки": "",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6702°с.ш. 37.5544°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Калужская",
    "Дата открытия": "12.08.1974",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6571°с.ш. 37.5405°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Беляево",
    "Дата открытия": "12.08.1974",
    "Пересадки": "",
    "Глубина": "−12 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6428°с.ш. 37.5257°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Коньково",
    "Дата открытия": "06.11.1987",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6333°с.ш. 37.5188°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Тёплый Стан",
    "Дата открытия": "06.11.1987",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6191°с.ш. 37.5082°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Ясенево",
    "Дата открытия": "17.01.1990",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6063°с.ш. 37.5333°в.д."
  },
  {
    "Линия": "Калужско-Рижская линия",
    "Название станции": "Новоясеневская",
    "Дата открытия": "17.01.1990",
    "Пересадки": "Переход на станцию Битцевский парк Бутовской линии",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6010°с.ш. 37.5541°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Планерная",
    "Дата открытия": "30.12.1975",
    "Пересадки": "",
    "Глубина": "−6 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8607°с.ш. 37.4364°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Сходненская",
    "Дата открытия": "30.12.1975",
    "Пересадки": "",
    "Глубина": "−6 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8505°с.ш. 37.4396°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Тушинская",
    "Дата открытия": "30.12.1975",
    "Пересадки": "",
    "Глубина": "−10,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8267°с.ш. 37.4368°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Спартак",
    "Дата открытия": "27.08.2014",
    "Пересадки": "",
    "Глубина": "−10 м[6]",
    "Тип конструкции": "колонная",
    "Координаты": "55.8182°с.ш. 37.4353°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Щукинская",
    "Дата открытия": "30.12.1975",
    "Пересадки": "",
    "Глубина": "−13 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8086°с.ш. 37.4641°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Октябрьское поле",
    "Дата открытия": "30.12.1972",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7935°с.ш. 37.4935°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Полежаевская",
    "Дата открытия": "30.12.1972",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7775°с.ш. 37.5192°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Беговая",
    "Дата открытия": "30.12.1972",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7738°с.ш. 37.5468°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Улица 1905 года",
    "Дата открытия": "30.12.1972",
    "Пересадки": "",
    "Глубина": "−11 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7650°с.ш. 37.5613°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Баррикадная",
    "Дата открытия": "30.12.1972",
    "Пересадки": "Переход на станцию Краснопресненская Кольцевой линии",
    "Глубина": "−30 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7612°с.ш. 37.5795°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Пушкинская",
    "Дата открытия": "17.12.1975",
    "Пересадки": "Переход на станцию Тверская Замоскворецкой линииПереход на станцию Чеховская Серпуховско-Тимирязевской линии",
    "Глубина": "−51 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7650°с.ш. 37.6079°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Кузнецкий мост",
    "Дата открытия": "17.12.1975",
    "Пересадки": "Переход на станцию Лубянка Сокольнической линии",
    "Глубина": "−39,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7606°с.ш. 37.6259°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Китай-город",
    "Дата открытия": "03.01.1971",
    "Пересадки": "Кросс-платформенная пересадка на станцию Китай-город Калужско-Рижской линии",
    "Глубина": "−29 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7553°с.ш. 37.6333°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Таганская",
    "Дата открытия": "31.12.1966",
    "Пересадки": "Переход на станцию Таганская Кольцевой линииПереход на станцию Марксистская Калининской линии",
    "Глубина": "−36 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7402°с.ш. 37.6522°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Пролетарская",
    "Дата открытия": "31.12.1966",
    "Пересадки": "Переход на станцию Крестьянская застава Люблинско-Дмитровской линии",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7319°с.ш. 37.6659°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Волгоградский проспект",
    "Дата открытия": "31.12.1966",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7253°с.ш. 37.6869°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Текстильщики",
    "Дата открытия": "31.12.1966",
    "Пересадки": "",
    "Глубина": "−13 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7088°с.ш. 37.7316°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Кузьминки",
    "Дата открытия": "31.12.1966",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7056°с.ш. 37.7656°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Рязанский проспект",
    "Дата открытия": "31.12.1966",
    "Пересадки": "",
    "Глубина": "−6 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7170°с.ш. 37.7933°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Выхино",
    "Дата открытия": "31.12.1966",
    "Пересадки": "",
    "Глубина": "0 м",
    "Тип конструкции": "наземная, открытая",
    "Координаты": "55.7156°с.ш. 37.8181°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Лермонтовский проспект",
    "Дата открытия": "09.11.2013",
    "Пересадки": "",
    "Глубина": "−12 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.7013°с.ш. 37.8525°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Жулебино",
    "Дата открытия": "09.11.2013",
    "Пересадки": "",
    "Глубина": "−15 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6855°с.ш. 37.8563°в.д."
  },
  {
    "Линия": "Таганско-Краснопресненская линия",
    "Название станции": "Котельники",
    "Дата открытия": "21.09.2015",
    "Пересадки": "",
    "Глубина": "−15 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6743°с.ш. 37.8582°в.д."
  },
  {
    "Линия": "Солнцевская линия",
    "Название станции": "Парк Победы",
    "Дата открытия": "31.01.2014",
    "Пересадки": "Кросс-платформенная пересадка на станцию Парк Победы Арбатско-Покровской линии",
    "Глубина": "−73,6 м[5]",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7362°с.ш. 37.5182°в.д."
  },
  {
    "Линия": "Солнцевская линия",
    "Название станции": "Деловой центр",
    "Дата открытия": "31.01.2014",
    "Пересадки": "Переход на станцию Выставочная Филёвской линии",
    "Глубина": "−25 м[7]",
    "Тип конструкции": "колонная",
    "Координаты": "55.7491°с.ш. 37.5395°в.д."
  },
  {
    "Линия": "Калининская линия",
    "Название станции": "Третьяковская",
    "Дата открытия": "25.01.1986",
    "Пересадки": "Переход на станцию Новокузнецкая Замоскворецкой линииКросс-платформенная пересадка на станцию Третьяковская Калужско-Рижской линии",
    "Глубина": "−46 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7412°с.ш. 37.6274°в.д."
  },
  {
    "Линия": "Калининская линия",
    "Название станции": "Марксистская",
    "Дата открытия": "30.12.1979",
    "Пересадки": "Переход на станцию Таганская Кольцевой линииПереход на станцию Таганская Таганско-Краснопресненской линии",
    "Глубина": "−60 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7411°с.ш. 37.6543°в.д."
  },
  {
    "Линия": "Калининская линия",
    "Название станции": "Площадь Ильича",
    "Дата открытия": "30.12.1979",
    "Пересадки": "Переход на станцию Римская Люблинско-Дмитровской линии",
    "Глубина": "−46 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7472°с.ш. 37.6824°в.д."
  },
  {
    "Линия": "Калининская линия",
    "Название станции": "Авиамоторная",
    "Дата открытия": "30.12.1979",
    "Пересадки": "",
    "Глубина": "−53 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7524°с.ш. 37.7191°в.д."
  },
  {
    "Линия": "Калининская линия",
    "Название станции": "Шоссе Энтузиастов",
    "Дата открытия": "30.12.1979",
    "Пересадки": "",
    "Глубина": "−53 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7576°с.ш. 37.7500°в.д."
  },
  {
    "Линия": "Калининская линия",
    "Название станции": "Перово",
    "Дата открытия": "30.12.1979",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.7511°с.ш. 37.7866°в.д."
  },
  {
    "Линия": "Калининская линия",
    "Название станции": "Новогиреево",
    "Дата открытия": "30.12.1979",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7517°с.ш. 37.8166°в.д."
  },
  {
    "Линия": "Калининская линия",
    "Название станции": "Новокосино",
    "Дата открытия": "30.08.2012",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.7451°с.ш. 37.8638°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Алтуфьево",
    "Дата открытия": "15.07.1994",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8980°с.ш. 37.5870°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Бибирево",
    "Дата открытия": "31.12.1992",
    "Пересадки": "",
    "Глубина": "−9,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8838°с.ш. 37.6034°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Отрадное",
    "Дата открытия": "01.03.1991",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8633°с.ш. 37.6047°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Владыкино",
    "Дата открытия": "01.03.1991",
    "Пересадки": "",
    "Глубина": "−10,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8473°с.ш. 37.5899°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Петровско-Разумовская",
    "Дата открытия": "01.03.1991",
    "Пересадки": "",
    "Глубина": "−61 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.8351°с.ш. 37.5745°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Тимирязевская",
    "Дата открытия": "01.03.1991",
    "Пересадки": "",
    "Глубина": "−63,5 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.8176°с.ш. 37.5765°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Дмитровская",
    "Дата открытия": "01.03.1991",
    "Пересадки": "",
    "Глубина": "−59 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.8069°с.ш. 37.5817°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Савёловская",
    "Дата открытия": "31.12.1988",
    "Пересадки": "",
    "Глубина": "−52 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7927°с.ш. 37.5885°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Менделеевская",
    "Дата открытия": "31.12.1988",
    "Пересадки": "Переход на станцию Новослободская Кольцевой линии",
    "Глубина": "−48,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7810°с.ш. 37.6011°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Цветной бульвар",
    "Дата открытия": "31.12.1988",
    "Пересадки": "Переход на станцию Трубная Люблинско-Дмитровской линии",
    "Глубина": "−50 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7708°с.ш. 37.6187°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Чеховская",
    "Дата открытия": "31.12.1987",
    "Пересадки": "Переход на станцию Тверская Замоскворецкой линииПереход на станцию Пушкинская Таганско-Краснопресненской линии",
    "Глубина": "−62 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7644°с.ш. 37.6097°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Боровицкая",
    "Дата открытия": "23.01.1986",
    "Пересадки": "Переход на станцию Библиотека имени Ленина Сокольнической линииПереход на станцию Арбатская Арбатско-Покровской линии",
    "Глубина": "−46,5 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7511°с.ш. 37.6072°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Полянка",
    "Дата открытия": "23.01.1986",
    "Пересадки": "",
    "Глубина": "−36,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7379°с.ш. 37.6180°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Серпуховская",
    "Дата открытия": "08.11.1983",
    "Пересадки": "Переход на станцию Добрынинская Кольцевой линии",
    "Глубина": "−43 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7280°с.ш. 37.6246°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Тульская",
    "Дата открытия": "08.11.1983",
    "Пересадки": "",
    "Глубина": "−9,5 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.7087°с.ш. 37.6229°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Нагатинская",
    "Дата открытия": "08.11.1983",
    "Пересадки": "",
    "Глубина": "−13,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6830°с.ш. 37.6224°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Нагорная",
    "Дата открытия": "08.11.1983",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6724°с.ш. 37.6104°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Нахимовский проспект",
    "Дата открытия": "08.11.1983",
    "Пересадки": "",
    "Глубина": "−9,5 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6627°с.ш. 37.6055°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Севастопольская",
    "Дата открытия": "08.11.1983",
    "Пересадки": "Переход на станцию Каховская Каховской линии",
    "Глубина": "−13 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6524°с.ш. 37.5984°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Чертановская",
    "Дата открытия": "08.11.1983",
    "Пересадки": "",
    "Глубина": "−10,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6405°с.ш. 37.6067°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Южная",
    "Дата открытия": "08.11.1983",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6224°с.ш. 37.6090°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Пражская",
    "Дата открытия": "06.11.1985",
    "Пересадки": "",
    "Глубина": "−9,5 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6124°с.ш. 37.6044°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Улица академика Янгеля",
    "Дата открытия": "31.08.2000",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.5949°с.ш. 37.6004°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Аннино",
    "Дата открытия": "12.12.2001",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.5828°с.ш. 37.5966°в.д."
  },
  {
    "Линия": "Серпуховско-Тимирязевская линия",
    "Название станции": "Бульвар Дмитрия Донского",
    "Дата открытия": "26.12.2002",
    "Пересадки": "Переход на станцию Улица Старокачаловская Бутовской линии",
    "Глубина": "−10 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.5693°с.ш. 37.5769°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Марьина роща",
    "Дата открытия": "19.06.2010",
    "Пересадки": "",
    "Глубина": "−60 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7954°с.ш. 37.6162°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Достоевская",
    "Дата открытия": "19.06.2010",
    "Пересадки": "",
    "Глубина": "−60 м",
    "Тип конструкции": "колонно-стеновая",
    "Координаты": "55.7816°с.ш. 37.6151°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Трубная",
    "Дата открытия": "30.08.2007",
    "Пересадки": "Переход на станцию Цветной бульвар Серпуховско-Тимирязевской линии",
    "Глубина": "−60 м",
    "Тип конструкции": "колонно-стеновая",
    "Координаты": "55.7688°с.ш. 37.6200°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Сретенский бульвар",
    "Дата открытия": "29.12.2007",
    "Пересадки": "Переход на станцию Чистые пруды Сокольнической линииПереход на станцию Тургеневская Калужско-Рижской линии",
    "Глубина": "−60 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7668°с.ш. 37.6392°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Чкаловская",
    "Дата открытия": "28.12.1995",
    "Пересадки": "Переход на станцию Курская Арбатско-Покровской линииПереход на станцию Курская Кольцевой линии",
    "Глубина": "−51 м",
    "Тип конструкции": "пилонная",
    "Координаты": "55.7565°с.ш. 37.6573°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Римская",
    "Дата открытия": "28.12.1995",
    "Пересадки": "Переход на станцию Площадь Ильича Калининской линии",
    "Глубина": "−54 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.7463°с.ш. 37.6819°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Крестьянская застава",
    "Дата открытия": "28.12.1995",
    "Пересадки": "Переход на станцию Пролетарская Таганско-Краснопресненской линии",
    "Глубина": "−47 м",
    "Тип конструкции": "колонно-стеновая",
    "Координаты": "55.7331°с.ш. 37.6673°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Дубровка",
    "Дата открытия": "11.12.1999",
    "Пересадки": "",
    "Глубина": "−62 м",
    "Тип конструкции": "колонно-стеновая",
    "Координаты": "55.7186°с.ш. 37.6760°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Кожуховская",
    "Дата открытия": "28.12.1995",
    "Пересадки": "",
    "Глубина": "−12 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.7074°с.ш. 37.6851°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Печатники",
    "Дата открытия": "28.12.1995",
    "Пересадки": "",
    "Глубина": "−4 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6934°с.ш. 37.7270°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Волжская",
    "Дата открытия": "28.12.1995",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "однопролётная",
    "Координаты": "55.6909°с.ш. 37.7530°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Люблино",
    "Дата открытия": "25.12.1996",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6758°с.ш. 37.7618°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Братиславская",
    "Дата открытия": "25.12.1996",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6597°с.ш. 37.7505°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Марьино",
    "Дата открытия": "25.12.1996",
    "Пересадки": "",
    "Глубина": "−8 м",
    "Тип конструкции": "однопролётная",
    "Координаты": "55.6500°с.ш. 37.7431°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Борисово",
    "Дата открытия": "02.12.2011",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6334°с.ш. 37.7436°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Шипиловская",
    "Дата открытия": "02.12.2011",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6211°с.ш. 37.7437°в.д."
  },
  {
    "Линия": "Люблинско-Дмитровская линия",
    "Название станции": "Зябликово",
    "Дата открытия": "02.12.2011",
    "Пересадки": "Переход на станцию Красногвардейская Замоскворецкой линии",
    "Глубина": "−15 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6124°с.ш. 37.7453°в.д."
  },
  {
    "Линия": "Каховская линия",
    "Название станции": "Каширская",
    "Дата открытия": "11.08.1969",
    "Пересадки": "Кросс-платформенная пересадка на станцию Каширская Замоскворецкой линии",
    "Глубина": "−7 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6551°с.ш. 37.6487°в.д."
  },
  {
    "Линия": "Каховская линия",
    "Название станции": "Варшавская",
    "Дата открытия": "11.08.1969",
    "Пересадки": "",
    "Глубина": "−9 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6533°с.ш. 37.6194°в.д."
  },
  {
    "Линия": "Каховская линия",
    "Название станции": "Каховская",
    "Дата открытия": "11.08.1969",
    "Пересадки": "Переход на станцию Севастопольская Серпуховско-Тимирязевской линии",
    "Глубина": "−8 м",
    "Тип конструкции": "колонная",
    "Координаты": "55.6530°с.ш. 37.5983°в.д."
  },
  {
    "Линия": "Бутовская линия",
    "Название станции": "Битцевский парк",
    "Дата открытия": "27.02.2014",
    "Пересадки": "Переход на станцию Новоясеневская Калужско-Рижской линии",
    "Глубина": "−10 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.6004°с.ш. 37.5562°в.д."
  },
  {
    "Линия": "Бутовская линия",
    "Название станции": "Лесопарковая",
    "Дата открытия": "27.02.2014",
    "Пересадки": "",
    "Глубина": "−10 м",
    "Тип конструкции": "односводчатая",
    "Координаты": "55.5821°с.ш. 37.5769°в.д."
  },
  {
    "Линия": "Бутовская линия",
    "Название станции": "Улица Старокачаловская",
    "Дата открытия": "27.12.2003",
    "Пересадки": "Переход на станцию Бульвар Дмитрия Донского Серпуховско-Тимирязевской линии",
    "Глубина": "−10 м",
    "Тип конструкции": "однопролётная",
    "Координаты": "55.5690°с.ш. 37.5767°в.д."
  },
  {
    "Линия": "Бутовская линия",
    "Название станции": "Улица Скобелевская",
    "Дата открытия": "27.12.2003",
    "Пересадки": "",
    "Глубина": "+9,6 м",
    "Тип конструкции": "эстакадная",
    "Координаты": "55.5481°с.ш. 37.5546°в.д."
  },
  {
    "Линия": "Бутовская линия",
    "Название станции": "Бульвар адмирала Ушакова",
    "Дата открытия": "27.12.2003",
    "Пересадки": "",
    "Глубина": "+9,6 м",
    "Тип конструкции": "эстакадная",
    "Координаты": "55.5455°с.ш. 37.5430°в.д."
  },
  {
    "Линия": "Бутовская линия",
    "Название станции": "Улица Горчакова",
    "Дата открытия": "27.12.2003",
    "Пересадки": "",
    "Глубина": "+9,6 м",
    "Тип конструкции": "эстакадная",
    "Координаты": "55.5418°с.ш. 37.5308°в.д."
  },
  {
    "Линия": "Бутовская линия",
    "Название станции": "Бунинская аллея",
    "Дата открытия": "27.12.2003",
    "Пересадки": "",
    "Глубина": "+9,6 м",
    "Тип конструкции": "эстакадная",
    "Координаты": "55.5380°с.ш. 37.5158°в.д."
  }
]

module.exports = stations;
